src/cf/Documents/УведомлениеОПеремещенииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УведомлениеОПеремещенииМДЛП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомленияОПеремещенииМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииПеремещенияМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоДеятельностиПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторПолучателя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПодтверждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтоПриходныйОрдер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСерии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоденДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКИЗ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСостояниеПодтверждения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРодительскойУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПолученияИнформации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСостояниеПодтверждения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПолученияИнформации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставТранспортныхУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСерии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерПроизводственнойСерииМДЛП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоденДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИерархияГрупповыхУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРодительскойУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/ор_ИнтеграцияМДЛПКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработка штрихкода на ТС ПИоТ.
// 
// Параметры:
//  ДанныеКМПроверки                          - Массив из см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам
//  ПараметрыПроверки                         - см. ШтрихкодированиеОбщегоНазначенияИСКлиент.НовыеПараметрыПроверкиНаККТ
//  ПараметрыСканирования                     - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ПараметрыПодключенияТСПИоТ                - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
//  ОповещениеПослеВыполненияПроверкиНаТСПИоТ - ОписаниеОповещения - действие, выполняемое после проверки при пробитии
// 
// Возвращаемое значение:
//  Обещание - Обработать асинхронно штрихкоды на ТС ПИоТ
Асинх Функция ОбработатьАсинхронноШтрихкодыНаТСПИоТПриПробитии(Знач ДанныеКМПроверки, ПараметрыПроверки, ПараметрыПодключенияТСПИоТ, ОповещениеПослеВыполненияПроверкиНаТСПИоТ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ОтсутствуютУстановленныеЛМЧЗ",      Ложь);
	ВозвращаемоеЗначение.Вставить("НачатаПроверкаНаВнутреннемТСПИоТ",  Ложь);
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                    Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                       "");
	ВозвращаемоеЗначение.Вставить("РезультатыОбработкиШтрихкода",      Новый Соответствие());
	ВозвращаемоеЗначение.Вставить("ПодключаемоеОборудование",          Неопределено);
	
	УникальныйИдентификаторФормы = ПараметрыПроверки.ФормаОсновногоОбъекта.УникальныйИдентификатор;
	ПараметрыСканирования        = ПараметрыПроверки.ПараметрыСканирования;
	
	СоответствиеЭлементов = Новый Соответствие();
	СписокДанныхШтрихкодовМДЛП = Новый Массив;
	
	Для Каждого ЭлементДанных Из ДанныеКМПроверки Цикл
		
		СтруктураКодаМаркировки = Новый Структура();
		СтруктураКодаМаркировки.Вставить("ПолныйКодМаркировки",          "");
		СтруктураКодаМаркировки.Вставить("НормализованныйКодМаркировки", "");
		СтруктураКодаМаркировки.Вставить("ВидПродукции",                 ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПустаяСсылка"));
		СтруктураКодаМаркировки.Вставить("СоставКодаМаркировки",         Новый Структура);
		СтруктураКодаМаркировки.Вставить("ПредставлениеНоменклатуры",    "");
		
		ЗаполнитьЗначенияСвойств(СтруктураКодаМаркировки, ЭлементДанных);
		
		НовыйЭлементПроверкиОнлайн = РазрешительныйРежимМДЛПКлиентСервер.НовыйЭлементДанныхДляПроверкиОнлайн();
		ЗаполнитьЗначенияСвойств(НовыйЭлементПроверкиОнлайн, СтруктураКодаМаркировки);
		СписокДанныхШтрихкодовМДЛП.Добавить(НовыйЭлементПроверкиОнлайн);
		СоответствиеЭлементов.Вставить(ЭлементДанных.ПолныйКодМаркировки, НовыйЭлементПроверкиОнлайн.ИдентификаторЭлемента);
		
	КонецЦикла;
	
	ПараметрыПроверкиКМНаКлиенте = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПроверкиКМНаТСПИоТ();
	ЗаполнитьЗначенияСвойств(ПараметрыПроверкиКМНаКлиенте, ПараметрыСканирования);
	ПараметрыПроверкиКМНаКлиенте.Организация                = ПараметрыСканирования.ОрганизацияМДЛП;
	ПараметрыПроверкиКМНаКлиенте.НомерФискальногоНакопителя = ПараметрыСканирования.НомерФискальногоНакопителя;
	ПараметрыПроверкиКМНаКлиенте.ККТФФД12МДЛП               = ПараметрыСканирования.ККТФФД12ИСМП;
	ПараметрыПроверкиКМНаКлиенте.ДанныеДляПроверки = СписокДанныхШтрихкодовМДЛП;
	
	#Если ВебКлиент Тогда
		ТекущийРезультатПроверки = Ждать ИнтеграцияТСПИоТМДЛПВебКлиент.ПроверитьКМНаТСПИоТ(ПараметрыПроверкиКМНаКлиенте);
	#Иначе
		ТекущийРезультатПроверки = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПроверитьКМНаТСПИоТ(ПараметрыПроверкиКМНаКлиенте);
	#КонецЕсли
	
	Если ТекущийРезультатПроверки.ЕстьОшибки
		И ЗначениеЗаполнено(ТекущийРезультатПроверки.ТекстОшибки) Тогда
		
		Для Каждого СтрокаОбработки Из ДанныеКМПроверки Цикл
			СтрокаОбработки.ТекстОшибки = ТекущийРезультатПроверки.ТекстОшибки;
		КонецЦикла;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	ТребуетсяПроверкаНаЛМЧЗ = ТекущийРезультатПроверки.КодыМаркировкиБезДанных <> Неопределено
		И ТекущийРезультатПроверки.КодыМаркировкиБезДанных.Количество() > 0;
	ДанныеПроверкиНаЛМ = Новый Соответствие;
	
	Для Каждого СтрокаОбработки Из ДанныеКМПроверки Цикл
		
		СтрокаОбработки.Вставить("ИдентификаторЭлемента", СокрЛП(Новый УникальныйИдентификатор));
		СтрокаОбработки.Вставить("ЭтоТоварМДЛП", Истина);
		СтрокаОбработки.Вставить("ВидПродукции", ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПустаяСсылка"));
		
		ИдентификаторЭлемента = СоответствиеЭлементов.Получить(СтрокаОбработки.ПолныйКодМаркировки);
		Если ИдентификаторЭлемента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыКодаМаркировки = ТекущийРезультатПроверки.ДанныеПроверки.Получить(ИдентификаторЭлемента);
		
		Если ПараметрыКодаМаркировки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваДляЗаполнения = ПараметрыКодаМаркировки;
		
		Для Каждого КлючИЗначение Из СвойстваДляЗаполнения Цикл
		
			Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаОбработки, КлючИЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОбработки[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			
		КонецЦикла;
		
		РезультатОбработки = Новый Структура;
		РезультатОбработки.Вставить("ТребуетсяАвторизацияИСМП",                                Ложь);
		РезультатОбработки.Вставить("ТребуетсяАвторизацияИСМПРозница",                         Ложь);
		РезультатОбработки.Вставить("ТребуетсяАктуализацияCDNПлощадок",                        Ложь);
		РезультатОбработки.Вставить("ОтсутствуютCDNПлощадки",                                  Ложь);
		РезультатОбработки.Вставить("ОтсутствуютУстановленныеЛМЧЗ",                            Ложь);
		РезультатОбработки.Вставить("ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле", ТребуетсяПроверкаНаЛМЧЗ);
		РезультатОбработки.Вставить("ПроверкаНаЛокальномМодулеЧестныйЗнакЗавершена",           Ложь);
		РезультатОбработки.Вставить("СписокЛокальныхМодулейДляОбработки",                      Неопределено);
		РезультатОбработки.Вставить("ДанныеНастройкиТСПИоТ",                                   Неопределено);
		РезультатОбработки.Вставить("ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ",          Ложь);
		РезультатОбработки.Вставить("ПроверкаНаТСПИоТЗавершена",                               Ложь);
		РезультатОбработки.Вставить("ПараметрыВыбораСерии",                                    Новый Структура);
		РезультатОбработки.Вставить("СтатусыГотовностиТСПИоТ",                                 Неопределено);
		
		ДанныеКодовМаркировки = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПараметрыКодаМаркировки);
		ДанныеКодовМаркировки.Вставить("ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле", ТребуетсяПроверкаНаЛМЧЗ);
		
		ДанныеКодовМаркировки.Вставить("ВидПродукции", ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПустаяСсылка"));
		ДанныеКодовМаркировки.Вставить("Штрихкод", ПараметрыКодаМаркировки.ПолныйКодМаркировки);
		
		РезультатОбработки.Вставить("ДанныеШтрихкода", ДанныеКодовМаркировки);
		
		ВозвращаемоеЗначение.РезультатыОбработкиШтрихкода.Вставить(
			СтрокаОбработки, РезультатОбработки);
		ДанныеПроверкиНаЛМ.Вставить(ДанныеКодовМаркировки, СтрокаОбработки);
		
	КонецЦикла;
	
	Если ТребуетсяПроверкаНаЛМЧЗ Тогда
		ЗапросРазрешительногоРежимаНаЛокальномМодулеЧестныйЗнак(
			ДанныеПроверкиНаЛМ,
			ПараметрыСканирования);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Процедура запускает процесс получения идентификаторов разрешительного режима оффлайн на клиентских локальных модулях
// 
// Параметры:
//  ДанныеОбработки       - Соответствие - данные для проверки, где:
//      * Ключ     - Структура - (См. ШтрихкодированиеИСМПКлиентНовыйЭлементПроверкиСредствамиККТПоДаннымРаспределения).
//      * Значение - Структура - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьДанныеШтрихкода)
//  ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования)
//
// Возвращаемое значение:
//  Структура:
//   * ОтсутствуютУстановленныеЛМЧЗ - Булево - если нет ни одного установленного клиентского локального модуля для проверки кода
//   * АварийныйРежим               - Булево - Истина, если действует аварийный режим и проверки не требуются
//   * ТекстОшибки                  - Строка - текст возникшей ошибки
Асинх Функция ЗапросРазрешительногоРежимаНаЛокальномМодулеЧестныйЗнак(ДанныеОбработки, ПараметрыСканирования = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ОтсутствуютУстановленныеЛМЧЗ", Ложь);
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",               Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                  "");
	
	ТекстВыполненияЗапроса = НСтр("ru = 'Выполняется разрешительный запрос ГИС МТ на Локальном модуле ""Честный знак""'");
	Состояние(ТекстВыполненияЗапроса, 0,, БиблиотекаКартинок.ДлительнаяОперация16);
	
	ДанныеКМОффлайнПроверки = Новый Массив;
	Для Каждого СтрокаДанныхШтрихкодов Из ДанныеОбработки Цикл
		
		Если Не СтрокаДанныхШтрихкодов.Ключ.ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеКМОффлайнПроверки.Добавить(ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(СтрокаДанныхШтрихкодов.Значение));
		
	КонецЦикла;
	
	ПараметрыПроверкиКМНаКлиенте = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПроверкиКМНаКлиентеНаСервере();
	ЗаполнитьЗначенияСвойств(ПараметрыПроверкиКМНаКлиенте, ПараметрыСканирования);
	ПараметрыПроверкиКМНаКлиенте.Организация       = ПараметрыСканирования.ОрганизацияМДЛП;
	ПараметрыПроверкиКМНаКлиенте.ККТФФД12МДЛП      = ПараметрыСканирования.ККТФФД12ИСМП;
	ПараметрыПроверкиКМНаКлиенте.ДанныеДляПроверки = ДанныеКМОффлайнПроверки;
	
	#Если ВебКлиент Тогда
		РезультатОффлайнЗапроса = Ждать РазрешительныйРежимМДЛПВебКлиент.ПроверитьКМНаЛокальномМодуле(ПараметрыПроверкиКМНаКлиенте);
	#Иначе
		РезультатОффлайнЗапроса = РазрешительныйРежимМДЛПКлиентСервер.ПроверитьКМНаЛокальномМодуле(ПараметрыПроверкиКМНаКлиенте);
	#КонецЕсли
	
	Для Каждого СтрокаДанныхШтрихкодов Из ДанныеОбработки Цикл
		ДанныеПоКМ      = СтрокаДанныхШтрихкодов.Ключ;
		СтрокаОбработки = СтрокаДанныхШтрихкодов.Значение;
		
		Если ЗначениеЗаполнено(РезультатОффлайнЗапроса.ТекстОшибки) Тогда
			
			ДанныеПоКМ.ТекстОшибки = РезультатОффлайнЗапроса.ТекстОшибки;
			
		КонецЕсли;
		
		Если РезультатОффлайнЗапроса.ОтсутствуютУстановленныеЛМ Тогда
			
			ДанныеПоКМ.ТекстОшибки = НСтр("ru = 'Локальный модуль Честный знак не установлен.'");
			
		ИначеЕсли РезультатОффлайнЗапроса.НезавершеннаяНастройкаЛМ Тогда
			
			ДанныеПоКМ.КонтролиРазрешительногоРежима.Добавить(ДанныеПоКМ.ТекстОшибки);
			
		ИначеЕсли РезультатОффлайнЗапроса.НекорректныеДанныеАвторизации Тогда
			
			ШаблонТекстаОшибки = НСтр("ru = 'Указаны некорректные логин/пароль подключения к Локальному модулю ""Честный знак"".'");
			ДанныеПоКМ.ТекстОшибки = ШаблонТекстаОшибки;
			
			ДанныеПоКМ.КонтролиРазрешительногоРежима.Добавить(ДанныеПоКМ.ТекстОшибки);
			
		ИначеЕсли РезультатОффлайнЗапроса.ОтсутствиеСинхронизацииЛМ Тогда
			
			ДанныеПоКМ.КонтролиРазрешительногоРежима.Добавить(ДанныеПоКМ.ТекстОшибки);
			
		КонецЕсли;
		
		ПараметрыКодаМаркировкиОффлайн = РезультатОффлайнЗапроса.ДанныеПроверки.Получить(СтрокаОбработки.ИдентификаторЭлемента);
		
		Если ПараметрыКодаМаркировкиОффлайн <> Неопределено Тогда
			
			ДанныеПоКМ.Вставить("ПродажаПоДаннымОффлайнРежима", Истина);
			
			СвойстваДляЗаполнения = ПараметрыКодаМаркировкиОффлайн;
			
			Для Каждого КлючИЗначение Из СвойстваДляЗаполнения Цикл
				
				Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
					Продолжить;
				КонецЕсли;
				
				Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПоКМ, КлючИЗначение.Ключ) Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеПоКМ[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Состояние(ТекстВыполненияЗапроса, 100,, БиблиотекаКартинок.ДлительнаяОперация16);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьНомераУпаковокПриСканировании(Объект, ДанныеШтрихкода, ПараметрыФормыУказания, СтруктураПараметров) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СтандартнаяОбработка", Истина);
	Результат.Вставить("СтрокиДляВыбора", Новый Массив);
	Результат.Вставить("СтрокиДляИзменения", Новый Массив);
	Результат.Вставить("ДобавитьНовуюСтроку", Ложь);
	Результат.Вставить("ТекстПредупреждения", "");
	
	ИмяТЧТовары = ПараметрыФормыУказания.ИмяТЧТовары;
	ИмяТЧСерии  = ПараметрыФормыУказания.ИмяТЧСерии;
	
	ДанныеМаркировкиМДЛП = Неопределено;
	
	Если СтруктураПараметров.Свойство("ДанныеМаркировкиМДЛП") Тогда
		ДанныеМаркировкиМДЛП = СтруктураПараметров.ДанныеМаркировкиМДЛП;
	ИначеЕсли СтруктураПараметров.Свойство("sgtin") Тогда
		ДанныеМаркировкиМДЛП = СтруктураПараметров;
	КонецЕсли;
	
	Если ДанныеМаркировкиМДЛП = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Ищем киз в уже добавленных строках.
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("НомерКиЗ", ДанныеМаркировкиМДЛП.sgtin);
	НайденныеСтрокиSGTIN = Объект[ИмяТЧСерии].НайтиСтроки(ПараметрыПоиска);
	Для Каждого СтрокаSGTIN Из НайденныеСтрокиSGTIN Цикл
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ор_ИдентификаторСтроки", СтрокаSGTIN.ИдентификаторСтроки);
		Если Объект[ИмяТЧТовары].НайтиСтроки(ПараметрыПоиска).Количество() > 0 Тогда
			Результат.ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Номер упаковки %1 уже присутствует в документе'"), ДанныеМаркировкиМДЛП.sgtin);
			Результат.СтандартнаяОбработка = Ложь;
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
	ПараметрыПоиска.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
	ПараметрыПоиска.Вставить("Партия", ДанныеШтрихкода.Партия);
	ПараметрыПоиска.Вставить("ЕдиницаИзмерения", ДанныеШтрихкода.ЕдиницаИзмерения);
	ПараметрыПоиска.Вставить("НоменклатураНабора", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ПараметрыПоиска.Вставить("ИспользоватьНомераУпаковок", Истина);
	НайденныеСтроки = Объект[ИмяТЧТовары].НайтиСтроки(ПараметрыПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Проверяем по уже добавленным строкам.
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ИдентификаторСтроки", ТекущаяСтрока.ор_ИдентификаторСтроки);
		НайденныеСтроки = Объект[ИмяТЧСерии].НайтиСтроки(ПараметрыПоиска);
		КоличествоУпаковок = НайденныеСтроки.Количество();
		Если КоличествоУпаковок > 0 Тогда
			СтрокаКиза = НайденныеСтроки[0];
			СтрокаКизаGTIN = Лев(СтрокаКиза.НомерКиЗ,14);
			Если ЗначениеЗаполнено(СтрокаКиза.НомерКиЗ)
				И СтрокаКизаGTIN <> ДанныеМаркировкиМДЛП.GTIN Тогда
				Результат.ТекстПредупреждения = НСтр("ru = 'GTIN %GTIN% отсканированного кода не соответствует GTIN %GTIN1% добавленных номеров упаковок для строки найденного товара.'");
				Результат.ТекстПредупреждения = СтрЗаменить(Результат.ТекстПредупреждения, "%GTIN%", ДанныеМаркировкиМДЛП.GTIN);
				Результат.ТекстПредупреждения = СтрЗаменить(Результат.ТекстПредупреждения, "%GTIN1%", СтрокаКизаGTIN);
				Результат.ДобавитьНовуюСтроку = Истина;
				Продолжить;
			КонецЕсли;
			
			Если КоличествоУпаковок < ТекущаяСтрока.Количество Тогда
				Результат.СтрокиДляВыбора.Добавить(ТекущаяСтрока);
			Иначе
				Результат.СтрокиДляИзменения.Добавить(ТекущаяСтрока);
			КонецЕсли;
		Иначе
			Результат.СтрокиДляВыбора.Добавить(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Результат.СтандартнаяОбработка = Результат.СтрокиДляВыбора.Количество() = 0
		И Результат.СтрокиДляИзменения.Количество() = 0
		И НЕ Результат.ДобавитьНовуюСтроку;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьИОтправитьУведомлениеОРозничнойПродаже(ЧекККМСсылка, ТекстСообщения) Экспорт
	
	ор_ИнтеграцияМДЛП.СоздатьИОтправитьУведомлениеОРозничнойПродаже(ЧекККМСсылка, ТекстСообщения);
	
КонецПроцедуры

Процедура ИзменитьСтатусыУпаковокУведомления(ЧекККМСсылка, ТекстСообщения) Экспорт
	
	ор_ИнтеграцияМДЛП.ИзменитьСтатусыУпаковокУведомления(ЧекККМСсылка, ТекстСообщения);
	
КонецПроцедуры

Процедура ПослеВыбораУведомленияОПеремещенииМДЛП(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	Если ор_ИнтеграцияМДЛП.СвязатьПеремещениеСУведомлением(ДополнительныеПараметры.ДокументСсылка, Результат, ТекстСообщения) Тогда
		Оповестить("Запись_УведомлениеОПеремещенииМДЛП", Новый Структура(), Результат);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКомандуЗарегистрироватьGTIN(Форма, Команда) Экспорт
	
	Если Не СтрЗаканчиваетсяНа(Команда.Имя, "ЗарегистрироватьGTIN") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.УведомлениеОПеремещенииМДЛП.Форма.ФормаДокумента"
		И Форма.Объект.Операция <> ПредопределенноеЗначение("Перечисление.ОперацииПеремещенияМДЛП.ПриходныйОрдер") Тогда
		ТекстСообщения = НСтр("ru = 'Регистрация GTIN доступна только для операции ""Приходный ордер"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.УведомлениеОПриемкеМДЛП.Форма.ФормаДокумента"
		И Форма.Объект.Операция = ПредопределенноеЗначение("Перечисление.ОперацииПриемкиМДЛП.ВозвратОтПокупателя") Тогда
		ТекстСообщения = НСтр("ru = 'Регистрация GTIN не доступна для возврата от покупателя.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИмяТабличнойЧасти = СтрЗаменить(Команда.Имя, "ЗарегистрироватьGTIN", "");
	
	МассивТоваров = Новый Массив;
	
	Если Форма.ИмяФормы = "ОбщаяФорма.ПодборНоменклатурыПоСоответствиюШтрихкодов" Тогда
		ТабличнаяЧастьТоваров = Форма[ИмяТабличнойЧасти];
	Иначе
		ТабличнаяЧастьТоваров = Форма.Объект[ИмяТабличнойЧасти];
	КонецЕсли;
	
	Для Каждого Строка Из ТабличнаяЧастьТоваров Цикл
		
		Если ЗначениеЗаполнено(Строка.GTIN)
			И ЗначениеЗаполнено(Строка.Номенклатура)
			И ЗначениеЗаполнено(Строка.Характеристика) Тогда
			СтруктураСтроки = Новый Структура("GTIN,Номенклатура,Характеристика");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
			МассивТоваров.Добавить(СтруктураСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивТоваров.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет данных для регистрации GTIN.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ор_ИнтеграцияМДЛП.ОбработатьМассивТоваровДляРегистрацииGTIN(МассивТоваров);
	
	Если МассивТоваров.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Данные по GTIN уже зарегистрированы.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивТоваров", МассивТоваров);
	ОткрытьФорму("ОбщаяФорма.ор_МДЛПФормаРегистрацииGTIN", ПараметрыФормы, Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСканирования(ПараметрыСканирования, Контекст) Экспорт
	
	ПередачаЧерезОФД = ор_ИнтеграцияМДЛП.ПолучитьПризнакПередачиДанныхМаркировкиЧерезОФД();
	КонтролироватьКММДЛП = ор_ИнтеграцияМДЛП.ПолучитьПризнакКонтролироватьКодыМаркировкиСредствамиККТ();
	
	НовыеПараметрыСканирования = Новый Структура;
	НовыеПараметрыСканирования.Вставить("ТребоватьПолныйКодМаркировкиИСМП", Ложь);
	НовыеПараметрыСканирования.Вставить("ЗапрашиватьДанныеНеизвестныхУпаковокИСМП", Ложь);
	НовыеПараметрыСканирования.Вставить("ЗапрашиватьДанныеСервисаИСМП",             Ложь);
	
	НовыеПараметрыСканирования.Вставить("ВидОперацииИСМП", ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа"));
	
	НовыеПараметрыСканирования.Вставить("КонтролироватьСтатусыКодовМаркировкиИСМП",    Ложь);
	НовыеПараметрыСканирования.Вставить("КонтролироватьВладельцевКодовМаркировкиИСМП", Ложь);
	НовыеПараметрыСканирования.Вставить("ТребуетсяПроверкаСредствамиККТ",              Ложь);
	НовыеПараметрыСканирования.Вставить("ККТФФД12ИСМП",                                Неопределено);
	НовыеПараметрыСканирования.Вставить("ПодключенноеККТИСМП",                         Неопределено);
	НовыеПараметрыСканирования.Вставить("ЭтоОблачнаяККТИСМП",                          Ложь);
	НовыеПараметрыСканирования.Вставить("НомерФискальногоНакопителя",                  "");
	
	НовыеПараметрыСканирования.Вставить("ИмяКолонкиРазрешительныйРежимИдентификаторЗапросаГИСМТ", Неопределено);
	НовыеПараметрыСканирования.Вставить("ИмяКолонкиРазрешительныйРежимДатаЗапросаГИСМТ",          Неопределено);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыСканирования, НовыеПараметрыСканирования, Ложь);
	
	Если НЕ КонтролироватьКММДЛП Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ЧекККМ")
		И НЕ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Обработка.РабочееМестоКассира") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ ИЛИ НЕ ЗначениеЗаполнено(ПараметрыСканирования.ККТФФД12ИСМП) Тогда
		ЗаполнитьПараметрыККТФФД12(ПараметрыСканирования, Контекст)
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыККТФФД12(ПараметрыСканирования, Контекст)
	
	ИдентификаторУстройства = Неопределено;
	ПараметрыКассыККМ       = Неопределено;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "ТаблицаКассККМОрганизаций") Тогда
		
		Отбор = Новый Структура("Организация", ПараметрыСканирования.Организация);
		СтрокаКассы = Контекст.ТаблицаКассККМОрганизаций.НайтиСтроки(Отбор)[0];
		
		ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ = СтрокаКассы.ПоддерживаетПроверкуКодовМаркировки;
		ПараметрыСканирования.ККТФФД12ИСМП = СтрокаКассы.ИдентификаторУстройства;
		ПараметрыСканирования.ПодключенноеККТИСМП = СтрокаКассы.ИдентификаторУстройства;
		ПараметрыСканирования.НомерФискальногоНакопителя = СтрокаКассы.НомерФискальногоНакопителя;
		Если ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ Тогда
			ПараметрыСканирования.ТребоватьПолныйКодМаркировкиИСМП = Истина;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "КассаККМ") Тогда
		ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(Контекст.КассаККМ);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "ПараметрыКассыККМ") Тогда
		ПараметрыКассыККМ = Контекст.ПараметрыКассыККМ;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст.Объект, "КассаККМ") Тогда
		ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(Контекст.Объект.КассаККМ);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "ФискальныйРегистратор")
		И ЗначениеЗаполнено(Контекст.ФискальныйРегистратор) Тогда
		ИдентификаторУстройства = Контекст.ФискальныйРегистратор;
	КонецЕсли;
	
	Если ИдентификаторУстройства = Неопределено
		И НЕ ПараметрыКассыККМ = Неопределено Тогда
		ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
	КонецЕсли;
	
	Если НЕ ИдентификаторУстройства = Неопределено Тогда
		
		ПараметрыСканирования.ПодключенноеККТИСМП = ИдентификаторУстройства;
		
		Если МенеджерОборудованияВызовСервера.ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ИдентификаторУстройства) Тогда
			ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ = Истина;
			ПараметрыСканирования.ККТФФД12ИСМП                   = ИдентификаторУстройства;
			ПараметрыСканирования.НомерФискальногоНакопителя     = ИнтеграцияИСУНФВызовСервера.ЗаводскойНомерФискальногоНакопителя(ИдентификаторУстройства);
		Иначе
			Если НЕ ПараметрыКассыККМ = Неопределено И ПараметрыКассыККМ.ЭтоОблачнаяККТ Тогда
				ПараметрыСканирования.ЭтоОблачнаяККТИСМП = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыСканирования.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
		
	КонецЕсли;
	
	Если ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ Тогда
		ПараметрыСканирования.ТребоватьПолныйКодМаркировкиИСМП = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция НужноЗапускатьПроверкуКМНаККТ(СтрокаРезультата, ДанныеШтрихкода = Неопределено, ЗапретитьВводНомеров = Ложь, ЭтоФормаВводаНомеров = Ложь) Экспорт
	
	Если ЗапретитьВводНомеров Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ор_ИнтеграцияМДЛП.ПолучитьПризнакКонтролироватьКодыМаркировкиСредствамиККТ() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ор_ИнтеграцияМДЛПКлиентСерверПовтИсп.РежимПроверкиКМПриСканировании() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеМаркировкиМДЛП = Неопределено;
	
	Если ЭтоФормаВводаНомеров Тогда
		ДанныеМаркировкиМДЛП = СтрокаРезультата;
	Иначе
		СтрокаРезультата.Свойство("ДанныеМаркировкиМДЛП", ДанныеМаркировкиМДЛП)
	КонецЕсли;
	
	Если ДанныеМаркировкиМДЛП = Неопределено  Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ор_ИнтеграцияМДЛПКлиентСервер.ЕстьКриптоХвостВДанныхМаркировки(ДанныеМаркировкиМДЛП) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтоФормаВводаНомеров Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеШтрихкода = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ор_ИнтеграцияМДЛП.ЭтоМаркируемыйТовар(ДанныеШтрихкода.Характеристика, ЗапретитьВводНомеров);
	
КонецФункции

Процедура ПроверкаКодаМаркировкиСредствамиККТПоДаннымШтрихкода(СтруктураПараметров, ФормаВладелец, ОписаниеОповещения) Экспорт
	
	Если ФормаВладелец.ИмяФормы = "ОбщаяФорма.ор_МДЛПФормаВводаНомеровУпаковок"
		ИЛИ ФормаВладелец.ИмяФормы = "ОбщаяФорма.ор_МДЛПФормаВводаНомеровУпаковокРМК" Тогда
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(ФормаВладелец.ВладелецФормы);
		ЗаполнитьПараметрыСканирования(ПараметрыСканирования, ФормаВладелец.ВладелецФормы);
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(ФормаВладелец, "Обработка.РабочееМестоКассира") Тогда
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(ФормаВладелец);
		Если ПараметрыСканирования.Организация <> СтруктураПараметров.Организация Тогда
			ПараметрыСканирования.Организация = СтруктураПараметров.Организация;
			ПараметрыСканирования.ОрганизацияМДЛП = ор_ИнтеграцияМДЛПКлиентСерверПовтИсп.ОрганизацияМДЛППоОрганизации(ПараметрыСканирования.Организация);
		КонецЕсли;
		ЗаполнитьПараметрыСканирования(ПараметрыСканирования, ФормаВладелец);
	Иначе
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(ФормаВладелец);
		ЗаполнитьПараметрыСканирования(ПараметрыСканирования, ФормаВладелец);
	КонецЕсли;
	
	НормализованныйШтрихкод = "(01)" + СтруктураПараметров.ДанныеМаркировкиМДЛП.GTIN + "(21)" + Сред(СтруктураПараметров.ДанныеМаркировкиМДЛП.SGTIN, 15);
	
	ДанныеШтрихкода = Новый Структура;
	ДанныеШтрихкода.Вставить("НормализованныйШтрихкод", НормализованныйШтрихкод);
	Если СтруктураПараметров.Свойство("ПолныйКодМаркировки") Тогда
		ДанныеШтрихкода.Вставить("ПолныйКодМаркировки", СтруктураПараметров.ПолныйКодМаркировки);
	Иначе
		ДанныеШтрихкода.Вставить("ПолныйКодМаркировки", СтруктураПараметров.ДанныеМаркировкиМДЛП.ШтрихкодBase64);
	КонецЕсли;
	ДанныеШтрихкода.Вставить("ПредставлениеНоменклатуры", СтруктураПараметров.ПредставлениеНоменклатуры);
	ДанныеШтрихкода.Вставить("ПредставлениеНоменклатурыРР", СтруктураПараметров.ПредставлениеНоменклатуры);
	ДанныеШтрихкода.Вставить("ВидУпаковки", ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская"));
	ДанныеШтрихкода.Вставить("ВидПродукции", ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПустаяСсылка"));
	ДанныеШтрихкода.Вставить("ШтрихкодУпаковки", Неопределено);
	ДанныеШтрихкода.Вставить("СоставКодаМаркировки", Неопределено);
	ДанныеШтрихкода.Вставить("ТребуетВзвешивания", Ложь);
	ДанныеШтрихкода.Вставить("Количество", 0);
	
	ЭлементыПроверки = Новый Массив;
	ЭлементПроверки = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.НовыйЭлементПроверкиСредствамиККТПоДаннымШтрихкода(ДанныеШтрихкода);
	ЭлементПроверки.Вставить("ЭтоЭлементМДЛП");
	ЭлементыПроверки.Добавить(ЭлементПроверки);
	
	ПараметрыОповещенияЗавершения = Новый Структура;
	ПараметрыОповещенияЗавершения.Вставить("ПроверкаПриСканированииМДЛПЗавершение", ОписаниеОповещения);
	//ПараметрыОповещенияЗавершения.Вставить("РезультатОбработкиШтрихкода", РезультатОбработкиШтрихкода);
	
	ОповещениеЗавершения = Новый ОписаниеОповещения(
		"ПроверкаКодовМаркировкиСредствамиККТЗавершение",
		ЭтотОбъект,
		ПараметрыОповещенияЗавершения);
	
	ПараметрыПроверки = ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ПараметрыНачалаПроверкиКодовМаркировкиСредствамиККТ();
	ПараметрыПроверки.ОповещениеОЗавершении = ОповещениеЗавершения;
	ПараметрыПроверки.ДанныеДляПроверки     = ЭлементыПроверки;
	ПараметрыПроверки.ПараметрыСканирования = ПараметрыСканирования;
	ПараметрыПроверки.ФормаОсновногоОбъекта = ФормаВладелец;
	ПараметрыПроверки.ЭтоСканирование       = Истина;
	
	ПараметрыПроверки.ЗаголовокКнопкиИгнорировать = НСтр("ru = 'Добавить товар'");
	
	ШтрихкодированиеОбщегоНазначенияИСМПКлиент.НачатьПроверкуКодовМаркировкиСредствамиККТ(ПараметрыПроверки);
	
КонецПроцедуры

Процедура ПроверкаКодовМаркировкиСредствамиККТЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ДополнительныеПараметры.ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ       = Ложь;
	//ДополнительныеПараметры.РезультатОбработкиШтрихкода.ТребуетсяПроверкаСредствамиККТ = Ложь;
	//ДополнительныеПараметры.РезультатОбработкиШтрихкода.ПроверкаСредствамиККТЗавершена = Истина;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПроверкаПриСканированииМДЛПЗавершение, Результат);
	
КонецПроцедуры


Процедура ОбработатьМассивШтрихкодовМДЛП(Объект, МассивШтрихкодов, ЗапретитьВводНомеров = Ложь, ТолькоМДЛП = Ложь) Экспорт
	
	НовыйМассивШтрихкодов = Новый Массив;
	
	Для Каждого СтрокаМассива Из МассивШтрихкодов Цикл
		
		СтруктураМаркировкиМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодПоТипу(СтрокаМассива.Штрихкод);
		
		// Для обработки в ветке ГосИС.
		СтрокаМассива.Вставить("ШтрихкодВBase64", ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ШтрихкодВBase64(СтрокаМассива.Штрихкод));
		СтрокаМассива.Вставить("ВозможнаМаркировкаГосИС",
			СтруктураМаркировкиМДЛП.Свойство("ГрупповаяУпаковка") Или СтруктураМаркировкиМДЛП.Свойство("МаркированныйТовар"));
		
		Если СтруктураМаркировкиМДЛП.Свойство("ГрупповаяУпаковка") Тогда
			
			ДанныеМаркировкиМДЛП = СтруктураМаркировкиМДЛП.Данные;
			ГрупповаяУпаковкаSSCC = ДанныеМаркировкиМДЛП.SSCC;
			
			ЕстьТранспортныеУпаковки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ор_ТранспортныеУпаковки");
			
			Если НЕ ЕстьТранспортныеУпаковки Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗапретитьВводНомеров Тогда
				ТекстСообщения = НСтр("ru = 'Штрихкод %1 определен как номер транспортной упаковки.Заполнение транспортных упаковкок недоступно.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ГрупповаяУпаковкаSSCC);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
			
			НайденныеСтроки = Объект.ор_ТранспортныеУпаковки.НайтиСтроки(Новый Структура("НомерУпаковки", ГрупповаяУпаковкаSSCC));
			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекстСообщения = НСтр("ru = 'Номер транспортной упаковки %1 уже присутствует в документе'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ГрупповаяУпаковкаSSCC);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.ор_ТранспортныеУпаковки.Добавить();
			НоваяСтрока.НомерУпаковки = ГрупповаяУпаковкаSSCC;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "ИдентификаторСтроки") Тогда
				НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			
		ИначеЕсли СтруктураМаркировкиМДЛП.Свойство("МаркированныйТовар") Тогда
			
			ДанныеМаркировкиМДЛП = СтруктураМаркировкиМДЛП.Данные;
			
			СтрокаМассива.Штрихкод = ДанныеМаркировкиМДЛП.Штрихкод;
			СтрокаМассива.Вставить("ДанныеМаркировкиМДЛП", ДанныеМаркировкиМДЛП);
			
			НовыйМассивШтрихкодов.Добавить(СтрокаМассива);
			
		Иначе
			
			Если ТолькоМДЛП Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Штрихкод %1 не являются номером упаковки.'"), СтрокаМассива.Штрихкод);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
			
			НовыйМассивШтрихкодов.Добавить(СтрокаМассива);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МассивШтрихкодов = НовыйМассивШтрихкодов;
	
КонецПроцедуры

Процедура ОбработатьМассивШтрихкодовМДЛПДубли(Объект, МассивШтрихкодов, ПараметрыФормыУказания) Экспорт
	
	ИмяТЧТовары = ПараметрыФормыУказания.ИмяТЧТовары;
	ИмяТЧСерии  = ПараметрыФормыУказания.ИмяТЧСерии;
	
	НовыйМассивШтрихкодов = Новый Массив;
	
	Для Каждого СтрокаМассива Из МассивШтрихкодов Цикл
		
		Если СтрокаМассива.Свойство("ДанныеМаркировкиМДЛП") Тогда
			
			ДанныеМаркировкиМДЛП = СтрокаМассива.ДанныеМаркировкиМДЛП;
			
			ЕстьДубли = Ложь;
			
			// Ищем киз в строках других товаров
			НайденныеСтрокиSGTIN = Объект[ИмяТЧСерии].НайтиСтроки(Новый Структура("НомерКиЗ", ДанныеМаркировкиМДЛП.sgtin));
			Для Каждого СтрокаSGTIN Из НайденныеСтрокиSGTIN Цикл
				Если Объект[ИмяТЧТовары].НайтиСтроки(Новый Структура("ор_ИдентификаторСтроки", СтрокаSGTIN.ИдентификаторСтроки)).Количество() > 0 Тогда
					ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Номер упаковки %1 уже присутствует в документе'"), ДанныеМаркировкиМДЛП.sgtin);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
					ЕстьДубли = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьДубли Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйМассивШтрихкодов.Добавить(СтрокаМассива);
			
		Иначе
			НовыйМассивШтрихкодов.Добавить(СтрокаМассива);
		КонецЕсли;
		
	КонецЦикла;
	
	МассивШтрихкодов = НовыйМассивШтрихкодов;
	
КонецПроцедуры

Процедура ЗаменитьРазделительGS1(Штрихкод) Экспорт
	
	РазделительGS1 = ОбщегоНазначенияБПОКлиентСервер.РазделительGS1();
	ЭкранированныйСимволGS1 = ОбщегоНазначенияБПОКлиентСервер.ЭкранированныйСимволGS1();
	Штрихкод = СтрЗаменить(Штрихкод, РазделительGS1, ЭкранированныйСимволGS1);
	
КонецПроцедуры

Функция ЭтоКассаСФФД12(КассаККМ) Экспорт
	
	Возврат ор_ИнтеграцияМДЛП.ЭтоКассаСФФД12(КассаККМ);
	
КонецФункции

#КонецОбласти
